ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fr6987.h
#define DMA2TSEL__DMAREQ     (0x0000)  /* DMA channel 2 transfer select 0:  DMA_REQ (sw) */
#define DMA2TSEL__TA0CCR0    (0x0001)  /* DMA channel 2 transfer select 1:  TA0CCR0 */
#define DMA2TSEL__TA0CCR2    (0x0002)  /* DMA channel 2 transfer select 2:  TA0CCR2 */
#define DMA2TSEL__TA1CCR0    (0x0003)  /* DMA channel 2 transfer select 3:  TA1CCR0 */
#define DMA2TSEL__TA1CCR2    (0x0004)  /* DMA channel 2 transfer select 4:  TA1CCR2 */
#define DMA2TSEL__TA2CCR0    (0x0005)  /* DMA channel 2 transfer select 5:  TA2CCR0 */
#define DMA2TSEL__TA3CCR0    (0x0006)  /* DMA channel 2 transfer select 6:  TA3CCR0 */
#define DMA2TSEL__TB0CCR0    (0x0007)  /* DMA channel 2 transfer select 7:  TB0CCR0 */
#define DMA2TSEL__TB0CCR2    (0x0008)  /* DMA channel 2 transfer select 8:  TB0CCR2 */
#define DMA2TSEL__RES9       (0x0009)  /* DMA channel 2 transfer select 9:  RES9 */
#define DMA2TSEL__RES10      (0x000A) /* DMA channel 2 transfer select 10: RES10 */
#define DMA2TSEL__AES_Trigger_0 (0x000B) /* DMA channel 2 transfer select 11: AES Trigger 0 */
#define DMA2TSEL__AES_Trigger_1 (0x000C) /* DMA channel 2 transfer select 12: AES Trigger 1 */
#define DMA2TSEL__AES_Trigger_2 (0x000D) /* DMA channel 2 transfer select 13: AES Trigger 2 */
#define DMA2TSEL__UCA0RXIFG  (0x000E) /* DMA channel 2 transfer select 14: UCA0RXIFG */
#define DMA2TSEL__UCA0TXIFG  (0x000F) /* DMA channel 2 transfer select 15: UCA0TXIFG */
#define DMA2TSEL__UCA1RXIFG  (0x0010) /* DMA channel 2 transfer select 16: UCA1RXIFG */
#define DMA2TSEL__UCA1TXIFG  (0x0011) /* DMA channel 2 transfer select 17: UCA1TXIFG */
#define DMA2TSEL__UCB0RXIFG0 (0x0012) /* DMA channel 2 transfer select 18: UCB0RXIFG0 */
#define DMA2TSEL__UCB0TXIFG0 (0x0013) /* DMA channel 2 transfer select 19: UCB0TXIFG0 */
#define DMA2TSEL__UCB0RXIFG1 (0x0014) /* DMA channel 2 transfer select 20: UCB0RXIFG1 */
#define DMA2TSEL__UCB0TXIFG1 (0x0015) /* DMA channel 2 transfer select 21: UCB0TXIFG1 */
#define DMA2TSEL__UCB0RXIFG2 (0x0016) /* DMA channel 2 transfer select 22: UCB0RXIFG2 */
#define DMA2TSEL__UCB0TXIFG2 (0x0017) /* DMA channel 2 transfer select 23: UCB0TXIFG2 */
#define DMA2TSEL__UCB1RXIFG0 (0x0018) /* DMA channel 2 transfer select 24: UCB1RXIFG0 */
#define DMA2TSEL__UCB1TXIFG0 (0x0019) /* DMA channel 2 transfer select 25: UCB1TXIFG0 */
#define DMA2TSEL__ADC12IFG   (0x001A) /* DMA channel 2 transfer select 26: ADC12IFG */
#define DMA2TSEL__RES27      (0x001B) /* DMA channel 2 transfer select 27: RES27 */
#define DMA2TSEL__ESI        (0x001C) /* DMA channel 2 transfer select 28: ESI */
#define DMA2TSEL__MPY        (0x001D) /* DMA channel 2 transfer select 29: MPY */
#define DMA2TSEL__DMA1IFG    (0x001E) /* DMA channel 2 transfer select 30: previous DMA channel DMA1IFG */
#define DMA2TSEL__DMAE0      (0x001F) /* DMA channel 2 transfer select 31: ext. Trigger (DMAE0) */


/************************************************************
* EXTENDED SCAN INTERFACE
************************************************************/
#define __MSP430_HAS_ESI__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_ESI__ 0x0D00
#define ESI_BASE __MSP430_BASEADDRESS_ESI__

#define ESIDEBUG1_            0x0D00      /* ESI debug register 1 */
sfrb(ESIDEBUG1_L , ESIDEBUG1_);
sfrb(ESIDEBUG1_H , ESIDEBUG1_+1);
sfrw(ESIDEBUG1, ESIDEBUG1_);
#define ESIDEBUG2_            0x0D02      /* ESI debug register 2 */
sfrb(ESIDEBUG2_L , ESIDEBUG2_);
sfrb(ESIDEBUG2_H , ESIDEBUG2_+1);
sfrw(ESIDEBUG2, ESIDEBUG2_);
#define ESIDEBUG3_            0x0D04      /* ESI debug register 3 */
sfrb(ESIDEBUG3_L , ESIDEBUG3_);
sfrb(ESIDEBUG3_H , ESIDEBUG3_+1);
sfrw(ESIDEBUG3, ESIDEBUG3_);
#define ESIDEBUG4_            0x0D06      /* ESI debug register 4 */
sfrb(ESIDEBUG4_L , ESIDEBUG4_);
sfrb(ESIDEBUG4_H , ESIDEBUG4_+1);
sfrw(ESIDEBUG4, ESIDEBUG4_);
#define ESIDEBUG5_            0x0D08      /* ESI debug register 5 */
sfrb(ESIDEBUG5_L , ESIDEBUG5_);
sfrb(ESIDEBUG5_H , ESIDEBUG5_+1);
sfrw(ESIDEBUG5, ESIDEBUG5_);
#define ESICNT0_              0x0D10      /* ESI PSM counter 0 */
sfrb(ESICNT0_L , ESICNT0_);
sfrb(ESICNT0_H , ESICNT0_+1);
sfrw(ESICNT0, ESICNT0_);
#define ESICNT1_              0x0D12      /* ESI PSM counter 1 */
sfrb(ESICNT1_L , ESICNT1_);
sfrb(ESICNT1_H , ESICNT1_+1);
sfrw(ESICNT1, ESICNT1_);
#define ESICNT2_              0x0D14      /* ESI PSM counter 2 */
sfrb(ESICNT2_L , ESICNT2_);
sfrb(ESICNT2_H , ESICNT2_+1);
sfrw(ESICNT2, ESICNT2_);
#define ESICNT3_              0x0D16      /* ESI oscillator counter register */
sfrb(ESICNT3_L , ESICNT3_);
sfrb(ESICNT3_H , ESICNT3_+1);
sfrw(ESICNT3, ESICNT3_);
#define ESIIV_                0x0D1A      /* ESI interrupt vector */
sfrb(ESIIV_L , ESIIV_);
sfrb(ESIIV_H , ESIIV_+1);
sfrw(ESIIV, ESIIV_);
#define ESIINT1_              0x0D1C      /* ESI interrupt register 1 */
sfrb(ESIINT1_L , ESIINT1_);
sfrb(ESIINT1_H , ESIINT1_+1);
sfrw(ESIINT1, ESIINT1_);
#define ESIINT2_              0x0D1E      /* ESI interrupt register 2 */
sfrb(ESIINT2_L , ESIINT2_);
sfrb(ESIINT2_H , ESIINT2_+1);
sfrw(ESIINT2, ESIINT2_);
#define ESIAFE_               0x0D20      /* ESI AFE control register */
sfrb(ESIAFE_L , ESIAFE_);
sfrb(ESIAFE_H , ESIAFE_+1);
sfrw(ESIAFE, ESIAFE_);
#define ESIPPU_               0x0D22      /* ESI PPU control register */
sfrb(ESIPPU_L , ESIPPU_);
sfrb(ESIPPU_H , ESIPPU_+1);
sfrw(ESIPPU, ESIPPU_);
#define ESITSM_               0x0D24      /* ESI TSM control register */
sfrb(ESITSM_L , ESITSM_);
sfrb(ESITSM_H , ESITSM_+1);
sfrw(ESITSM, ESITSM_);
#define ESIPSM_               0x0D26      /* ESI PSM control register */
sfrb(ESIPSM_L , ESIPSM_);
sfrb(ESIPSM_H , ESIPSM_+1);
sfrw(ESIPSM, ESIPSM_);
#define ESIOSC_               0x0D28      /* ESI oscillator control register*/
sfrb(ESIOSC_L , ESIOSC_);
sfrb(ESIOSC_H , ESIOSC_+1);
sfrw(ESIOSC, ESIOSC_);
#define ESICTL_               0x0D2A      /* ESI control register */
sfrb(ESICTL_L , ESICTL_);
sfrb(ESICTL_H , ESICTL_+1);
sfrw(ESICTL, ESICTL_);
#define ESITHR1_              0x0D2C      /* ESI PSM Counter Threshold 1 register */
sfrb(ESITHR1_L , ESITHR1_);
sfrb(ESITHR1_H , ESITHR1_+1);
sfrw(ESITHR1, ESITHR1_);
#define ESITHR2_              0x0D2E      /* ESI PSM Counter Threshold 2 register */
sfrb(ESITHR2_L , ESITHR2_);
sfrb(ESITHR2_H , ESITHR2_+1);
sfrw(ESITHR2, ESITHR2_);
#define ESIDAC1R0_            0x0D40      /* ESI DAC1 register 0 */
sfrb(ESIDAC1R0_L , ESIDAC1R0_);
sfrb(ESIDAC1R0_H , ESIDAC1R0_+1);
sfrw(ESIDAC1R0, ESIDAC1R0_);
#define ESIDAC1R1_            0x0D42      /* ESI DAC1 register 1 */
sfrb(ESIDAC1R1_L , ESIDAC1R1_);
sfrb(ESIDAC1R1_H , ESIDAC1R1_+1);
sfrw(ESIDAC1R1, ESIDAC1R1_);
#define ESIDAC1R2_            0x0D44      /* ESI DAC1 register 2 */
sfrb(ESIDAC1R2_L , ESIDAC1R2_);
sfrb(ESIDAC1R2_H , ESIDAC1R2_+1);
sfrw(ESIDAC1R2, ESIDAC1R2_);
#define ESIDAC1R3_            0x0D46      /* ESI DAC1 register 3 */
sfrb(ESIDAC1R3_L , ESIDAC1R3_);
sfrb(ESIDAC1R3_H , ESIDAC1R3_+1);
sfrw(ESIDAC1R3, ESIDAC1R3_);
#define ESIDAC1R4_            0x0D48      /* ESI DAC1 register 4 */
sfrb(ESIDAC1R4_L , ESIDAC1R4_);
sfrb(ESIDAC1R4_H , ESIDAC1R4_+1);
sfrw(ESIDAC1R4, ESIDAC1R4_);
#define ESIDAC1R5_            0x0D4A      /* ESI DAC1 register 5 */
sfrb(ESIDAC1R5_L , ESIDAC1R5_);
sfrb(ESIDAC1R5_H , ESIDAC1R5_+1);
sfrw(ESIDAC1R5, ESIDAC1R5_);
#define ESIDAC1R6_            0x0D4C      /* ESI DAC1 register 6 */
sfrb(ESIDAC1R6_L , ESIDAC1R6_);
sfrb(ESIDAC1R6_H , ESIDAC1R6_+1);
sfrw(ESIDAC1R6, ESIDAC1R6_);
#define ESIDAC1R7_            0x0D4E      /* ESI DAC1 register 7 */
sfrb(ESIDAC1R7_L , ESIDAC1R7_);
sfrb(ESIDAC1R7_H , ESIDAC1R7_+1);
sfrw(ESIDAC1R7, ESIDAC1R7_);
#define ESIDAC2R0_            0x0D50      /* ESI DAC2 register 0 */
sfrb(ESIDAC2R0_L , ESIDAC2R0_);
sfrb(ESIDAC2R0_H , ESIDAC2R0_+1);
sfrw(ESIDAC2R0, ESIDAC2R0_);
#define ESIDAC2R1_            0x0D52      /* ESI DAC2 register 1 */
sfrb(ESIDAC2R1_L , ESIDAC2R1_);
sfrb(ESIDAC2R1_H , ESIDAC2R1_+1);
sfrw(ESIDAC2R1, ESIDAC2R1_);
#define ESIDAC2R2_            0x0D54      /* ESI DAC2 register 2 */
sfrb(ESIDAC2R2_L , ESIDAC2R2_);
sfrb(ESIDAC2R2_H , ESIDAC2R2_+1);
sfrw(ESIDAC2R2, ESIDAC2R2_);
#define ESIDAC2R3_            0x0D56      /* ESI DAC2 register 3 */
sfrb(ESIDAC2R3_L , ESIDAC2R3_);
sfrb(ESIDAC2R3_H , ESIDAC2R3_+1);
sfrw(ESIDAC2R3, ESIDAC2R3_);
#define ESIDAC2R4_            0x0D58      /* ESI DAC2 register 4 */
sfrb(ESIDAC2R4_L , ESIDAC2R4_);
sfrb(ESIDAC2R4_H , ESIDAC2R4_+1);
sfrw(ESIDAC2R4, ESIDAC2R4_);
#define ESIDAC2R5_            0x0D5A      /* ESI DAC2 register 5 */
sfrb(ESIDAC2R5_L , ESIDAC2R5_);
sfrb(ESIDAC2R5_H , ESIDAC2R5_+1);
sfrw(ESIDAC2R5, ESIDAC2R5_);
#define ESIDAC2R6_            0x0D5C      /* ESI DAC2 register 6 */
sfrb(ESIDAC2R6_L , ESIDAC2R6_);
sfrb(ESIDAC2R6_H , ESIDAC2R6_+1);
sfrw(ESIDAC2R6, ESIDAC2R6_);
#define ESIDAC2R7_            0x0D5E      /* ESI DAC2 register 7 */
sfrb(ESIDAC2R7_L , ESIDAC2R7_);
sfrb(ESIDAC2R7_H , ESIDAC2R7_+1);
sfrw(ESIDAC2R7, ESIDAC2R7_);
#define ESITSM0_              0x0D60      /* ESI TSM 0 */
sfrb(ESITSM0_L , ESITSM0_);
sfrb(ESITSM0_H , ESITSM0_+1);
sfrw(ESITSM0, ESITSM0_);
#define ESITSM1_              0x0D62      /* ESI TSM 1 */
sfrb(ESITSM1_L , ESITSM1_);
sfrb(ESITSM1_H , ESITSM1_+1);
sfrw(ESITSM1, ESITSM1_);
#define ESITSM2_              0x0D64      /* ESI TSM 2 */
sfrb(ESITSM2_L , ESITSM2_);
sfrb(ESITSM2_H , ESITSM2_+1);
sfrw(ESITSM2, ESITSM2_);
#define ESITSM3_              0x0D66      /* ESI TSM 3 */
sfrb(ESITSM3_L , ESITSM3_);
sfrb(ESITSM3_H , ESITSM3_+1);
sfrw(ESITSM3, ESITSM3_);
#define ESITSM4_              0x0D68      /* ESI TSM 4 */
sfrb(ESITSM4_L , ESITSM4_);
sfrb(ESITSM4_H , ESITSM4_+1);
sfrw(ESITSM4, ESITSM4_);
#define ESITSM5_              0x0D6A      /* ESI TSM 5 */
sfrb(ESITSM5_L , ESITSM5_);
sfrb(ESITSM5_H , ESITSM5_+1);
sfrw(ESITSM5, ESITSM5_);
#define ESITSM6_              0x0D6C      /* ESI TSM 6 */
sfrb(ESITSM6_L , ESITSM6_);
sfrb(ESITSM6_H , ESITSM6_+1);
sfrw(ESITSM6, ESITSM6_);
#define ESITSM7_              0x0D6E      /* ESI TSM 7 */
sfrb(ESITSM7_L , ESITSM7_);
sfrb(ESITSM7_H , ESITSM7_+1);
sfrw(ESITSM7, ESITSM7_);
#define ESITSM8_              0x0D70      /* ESI TSM 8 */
sfrb(ESITSM8_L , ESITSM8_);
sfrb(ESITSM8_H , ESITSM8_+1);
sfrw(ESITSM8, ESITSM8_);
#define ESITSM9_              0x0D72      /* ESI TSM 9 */
sfrb(ESITSM9_L , ESITSM9_);
sfrb(ESITSM9_H , ESITSM9_+1);
sfrw(ESITSM9, ESITSM9_);
#define ESITSM10_             0x0D74      /* ESI TSM 10 */
sfrb(ESITSM10_L , ESITSM10_);
sfrb(ESITSM10_H , ESITSM10_+1);
sfrw(ESITSM10, ESITSM10_);
#define ESITSM11_             0x0D76      /* ESI TSM 11 */
sfrb(ESITSM11_L , ESITSM11_);
sfrb(ESITSM11_H , ESITSM11_+1);
sfrw(ESITSM11, ESITSM11_);
#define ESITSM12_             0x0D78      /* ESI TSM 12 */
sfrb(ESITSM12_L , ESITSM12_);
sfrb(ESITSM12_H , ESITSM12_+1);
sfrw(ESITSM12, ESITSM12_);
#define ESITSM13_             0x0D7A      /* ESI TSM 13 */
sfrb(ESITSM13_L , ESITSM13_);
sfrb(ESITSM13_H , ESITSM13_+1);
sfrw(ESITSM13, ESITSM13_);
#define ESITSM14_             0x0D7C      /* ESI TSM 14 */
sfrb(ESITSM14_L , ESITSM14_);
sfrb(ESITSM14_H , ESITSM14_+1);
sfrw(ESITSM14, ESITSM14_);
#define ESITSM15_             0x0D7E      /* ESI TSM 15 */
sfrb(ESITSM15_L , ESITSM15_);
sfrb(ESITSM15_H , ESITSM15_+1);
sfrw(ESITSM15, ESITSM15_);
#define ESITSM16_             0x0D80      /* ESI TSM 16 */
sfrb(ESITSM16_L , ESITSM16_);
sfrb(ESITSM16_H , ESITSM16_+1);
sfrw(ESITSM16, ESITSM16_);
#define ESITSM17_             0x0D82      /* ESI TSM 17 */
sfrb(ESITSM17_L , ESITSM17_);
sfrb(ESITSM17_H , ESITSM17_+1);
sfrw(ESITSM17, ESITSM17_);
#define ESITSM18_             0x0D84      /* ESI TSM 18 */
sfrb(ESITSM18_L , ESITSM18_);
sfrb(ESITSM18_H , ESITSM18_+1);
sfrw(ESITSM18, ESITSM18_);
#define ESITSM19_             0x0D86      /* ESI TSM 19 */
sfrb(ESITSM19_L , ESITSM19_);
sfrb(ESITSM19_H , ESITSM19_+1);
sfrw(ESITSM19, ESITSM19_);
#define ESITSM20_             0x0D88      /* ESI TSM 20 */
sfrb(ESITSM20_L , ESITSM20_);
sfrb(ESITSM20_H , ESITSM20_+1);
sfrw(ESITSM20, ESITSM20_);
#define ESITSM21_             0x0D8A      /* ESI TSM 21 */
sfrb(ESITSM21_L , ESITSM21_);
sfrb(ESITSM21_H , ESITSM21_+1);
sfrw(ESITSM21, ESITSM21_);
#define ESITSM22_             0x0D8C      /* ESI TSM 22 */
sfrb(ESITSM22_L , ESITSM22_);
sfrb(ESITSM22_H , ESITSM22_+1);
sfrw(ESITSM22, ESITSM22_);
#define ESITSM23_             0x0D8E      /* ESI TSM 23 */
sfrb(ESITSM23_L , ESITSM23_);
sfrb(ESITSM23_H , ESITSM23_+1);
sfrw(ESITSM23, ESITSM23_);
#define ESITSM24_             0x0D90      /* ESI TSM 24 */
sfrb(ESITSM24_L , ESITSM24_);
sfrb(ESITSM24_H , ESITSM24_+1);
sfrw(ESITSM24, ESITSM24_);
#define ESITSM25_             0x0D92      /* ESI TSM 25 */
sfrb(ESITSM25_L , ESITSM25_);
sfrb(ESITSM25_H , ESITSM25_+1);
sfrw(ESITSM25, ESITSM25_);
#define ESITSM26_             0x0D94      /* ESI TSM 26 */
sfrb(ESITSM26_L , ESITSM26_);
sfrb(ESITSM26_H , ESITSM26_+1);
sfrw(ESITSM26, ESITSM26_);
#define ESITSM27_             0x0D96      /* ESI TSM 27 */
sfrb(ESITSM27_L , ESITSM27_);
sfrb(ESITSM27_H , ESITSM27_+1);
sfrw(ESITSM27, ESITSM27_);
#define ESITSM28_             0x0D98      /* ESI TSM 28 */
sfrb(ESITSM28_L , ESITSM28_);
sfrb(ESITSM28_H , ESITSM28_+1);
sfrw(ESITSM28, ESITSM28_);
#define ESITSM29_             0x0D9A      /* ESI TSM 29 */
sfrb(ESITSM29_L , ESITSM29_);
sfrb(ESITSM29_H , ESITSM29_+1);
sfrw(ESITSM29, ESITSM29_);
#define ESITSM30_             0x0D9C      /* ESI TSM 30 */
sfrb(ESITSM30_L , ESITSM30_);
sfrb(ESITSM30_H , ESITSM30_+1);
sfrw(ESITSM30, ESITSM30_);
#define ESITSM31_             0x0D9E      /* ESI TSM 31 */
sfrb(ESITSM31_L , ESITSM31_);
sfrb(ESITSM31_H , ESITSM31_+1);
sfrw(ESITSM31, ESITSM31_);


/* ESIIV Control Bits */


#define ESIIV_NONE          (0x0000)      /* No ESI Interrupt Pending */
#define ESIIV_ESIIFG1       (0x0002)      /* rising edge of the ESISTOP(tsm) */
#define ESIIV_ESIIFG0       (0x0004)      /* ESIOUT0 to ESIOUT3 conditions selected by ESIIFGSETx bits */
#define ESIIV_ESIIFG8       (0x0006)      /* ESIOUT4 to ESIOUT7 conditions selected by ESIIFGSET2x bits */
#define ESIIV_ESIIFG3       (0x0008)      /* ESICNT1 counter conditions selected with the ESITHR1 and ESITHR2 registers */
#define ESIIV_ESIIFG6       (0x000A)      /* PSM transitions to a state with a Q7 bit */
#define ESIIV_ESIIFG5       (0x000C)      /* PSM transitions to a state with a Q6 bit */
#define ESIIV_ESIIFG4       (0x000E)      /* ESICNT2 counter conditions selected with the ESIIS2x bits */
#define ESIIV_ESIIFG7       (0x0010)      /* ESICNT0 counter conditions selected with the ESIIS0x bits */
#define ESIIV_ESIIFG2       (0x0012)      /* start of a TSM sequence */

/* ESIINT1 Control Bits */
#define ESIIFGSET22         (0x8000)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET21         (0x4000)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET20         (0x2000)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET12         (0x1000)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET11         (0x0800)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET10         (0x0400)      /* ESIIFG0 interrupt flag source */
#define ESIIE8              (0x0100)      /* Interrupt enable */
#define ESIIE7              (0x0080)      /* Interrupt enable */
#define ESIIE6              (0x0040)      /* Interrupt enable */
#define ESIIE5              (0x0020)      /* Interrupt enable */
#define ESIIE4              (0x0010)      /* Interrupt enable */
#define ESIIE3              (0x0008)      /* Interrupt enable */
#define ESIIE2              (0x0004)      /* Interrupt enable */
#define ESIIE1              (0x0002)      /* Interrupt enable */
#define ESIIE0              (0x0001)      /* Interrupt enable */

/* ESIINT1 Control Bits */
#define ESIIE7_L            (0x0080)      /* Interrupt enable */
#define ESIIE6_L            (0x0040)      /* Interrupt enable */
#define ESIIE5_L            (0x0020)      /* Interrupt enable */
#define ESIIE4_L            (0x0010)      /* Interrupt enable */
#define ESIIE3_L            (0x0008)      /* Interrupt enable */
#define ESIIE2_L            (0x0004)      /* Interrupt enable */
#define ESIIE1_L            (0x0002)      /* Interrupt enable */
#define ESIIE0_L            (0x0001)      /* Interrupt enable */

/* ESIINT1 Control Bits */
#define ESIIFGSET22_H       (0x0080)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET21_H       (0x0040)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET20_H       (0x0020)      /* ESIIFG8 interrupt flag source */
#define ESIIFGSET12_H       (0x0010)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET11_H       (0x0008)      /* ESIIFG0 interrupt flag source */
#define ESIIFGSET10_H       (0x0004)      /* ESIIFG0 interrupt flag source */
#define ESIIE8_H            (0x0001)      /* Interrupt enable */

#define ESIIFGSET2_0        (0x0000)      /* ESIIFG8 is set when ESIOUT4 is set */
#define ESIIFGSET2_1        (0x2000)      /* ESIIFG8 is set when ESIOUT4 is reset */
#define ESIIFGSET2_2        (0x4000)      /* ESIIFG8 is set when ESIOUT5 is set */
#define ESIIFGSET2_3        (0x6000)      /* ESIIFG8 is set when ESIOUT5 is reset */
#define ESIIFGSET2_4        (0x8000)      /* ESIIFG8 is set when ESIOUT6 is set */
#define ESIIFGSET2_5        (0xA000)      /* ESIIFG8 is set when ESIOUT6 is reset */
#define ESIIFGSET2_6        (0xC000)      /* ESIIFG8 is set when ESIOUT7 is set */
#define ESIIFGSET2_7        (0xE000)      /* ESIIFG8 is set when ESIOUT7 is reset */
#define ESIIFGSET1_0        (0x0000)      /* ESIIFG0 is set when ESIOUT0 is set */
#define ESIIFGSET1_1        (0x0400)      /* ESIIFG0 is set when ESIOUT0 is reset */
#define ESIIFGSET1_2        (0x0800)      /* ESIIFG0 is set when ESIOUT1 is set */
#define ESIIFGSET1_3        (0x0C00)      /* ESIIFG0 is set when ESIOUT1 is reset */
#define ESIIFGSET1_4        (0x1000)      /* ESIIFG0 is set when ESIOUT2 is set */
#define ESIIFGSET1_5        (0x1400)      /* ESIIFG0 is set when ESIOUT2 is reset */
#define ESIIFGSET1_6        (0x1800)      /* ESIIFG0 is set when ESIOUT3 is set */
#define ESIIFGSET1_7        (0x1C00)      /* ESIIFG0 is set when ESIOUT3 is reset */


/* ESIINT2 Control Bits */
#define ESIIS21             (0x4000)      /* SIFIFG4 interrupt flag source */
#define ESIIS20             (0x2000)      /* SIFIFG4 interrupt flag source */
#define ESIIS01             (0x0800)      /* SIFIFG7 interrupt flag source */
#define ESIIS00             (0x0400)      /* SIFIFG7 interrupt flag source */
#define ESIIFG8             (0x0100)      /* ESIIFG8 interrupt pending */
#define ESIIFG7             (0x0080)      /* ESIIFG7 interrupt pending */
#define ESIIFG6             (0x0040)      /* ESIIFG6 interrupt pending */
#define ESIIFG5             (0x0020)      /* ESIIFG5 interrupt pending */
#define ESIIFG4             (0x0010)      /* ESIIFG4 interrupt pending */
#define ESIIFG3             (0x0008)      /* ESIIFG3 interrupt pending */
#define ESIIFG2             (0x0004)      /* ESIIFG2 interrupt pending */
#define ESIIFG1             (0x0002)      /* ESIIFG1 interrupt pending */
#define ESIIFG0             (0x0001)      /* ESIIFG0 interrupt pending */

/* ESIINT2 Control Bits */
#define ESIIFG7_L           (0x0080)      /* ESIIFG7 interrupt pending */
#define ESIIFG6_L           (0x0040)      /* ESIIFG6 interrupt pending */
#define ESIIFG5_L           (0x0020)      /* ESIIFG5 interrupt pending */
#define ESIIFG4_L           (0x0010)      /* ESIIFG4 interrupt pending */
#define ESIIFG3_L           (0x0008)      /* ESIIFG3 interrupt pending */
#define ESIIFG2_L           (0x0004)      /* ESIIFG2 interrupt pending */
#define ESIIFG1_L           (0x0002)      /* ESIIFG1 interrupt pending */
#define ESIIFG0_L           (0x0001)      /* ESIIFG0 interrupt pending */

/* ESIINT2 Control Bits */
#define ESIIS21_H           (0x0040)      /* SIFIFG4 interrupt flag source */
#define ESIIS20_H           (0x0020)      /* SIFIFG4 interrupt flag source */
#define ESIIS01_H           (0x0008)      /* SIFIFG7 interrupt flag source */
#define ESIIS00_H           (0x0004)      /* SIFIFG7 interrupt flag source */
#define ESIIFG8_H           (0x0001)      /* ESIIFG8 interrupt pending */

